       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG17.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.

       PROGRAM-DONE.
           STOP RUN.
