       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG18.
      * USO E INICIALIZAÇÃO DE VARIÁVEIS.
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  VALOR_1     PIC 99 VALUE 20.
       01  MENSAGEM    PIC X(20) VALUE "CURSO DE OPENCOBOL".
      * PODE SER ATRIBUIDOS ZERO,ZEROS OU SEROES A VARIÁVEL.
       01  VALOR_2     PIC 99 VALUE ZEROS.
      * PODE SER ATRIBUDO SPACE OU SPACES A VARIÁVEL.
       01  TEXTO       PIC X(35) VALUES SPACE.
       01  SEPARACAO   PIC X(10) VALUE "----------".

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           DISPLAY "VALOR 1  = " VALOR_1.
           DISPLAY "MENSAGEM : " MENSAGEM.
           DISPLAY SEPARACAO.
           DISPLAY "VALOR 2  = " VALOR_2.
           DISPLAY "TEXTO    : " TEXTO.
           DISPLAY SEPARACAO.
           DISPLAY "ATRIBUI VALORES A VARIÁVEL VALOR_2".
           ADD 30 TO VALOR_2.
           DISPLAY "VALOR 2  = " VALOR_2.
       PROGRAM-DONE.
           STOP RUN.
