       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG12_2.
      *    PROGRAMA PARA EXIBIR PARAGRAFOS. AGORA USANDO PARAGRAFOS.
       ENVIRONMENT DIVISION.

       DATA DIVISION.

       WORKING-STORAGE SECTION.
       01  VALOR-A PIC 9(4).
       01  VALOR-B PIC 9(4).
       01  RESPOSTA PIC 9(4).
       01  MENSAGEM PIC X(40).

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.

      *    USANDO PERFORM COMO RETORNO DE FUNÇÃO.

           PERFORM LIMPA-TERMINAL.

           MOVE "PROGRAMA SOMAR NUMEROS" TO MENSAGEM.
           PERFORM EXIBIR-MENSAGEM.
           PERFORM ENTRADA-DE-VALORES.
           PERFORM SOMAR-NUMEROS.
           MOVE "A soma de A com B eh igual a " TO MENSAGEM.
           PERFORM EXIBIR-MENSAGEM.
           MOVE RESPOSTA TO MENSAGEM.
           PERFORM EXIBIR-MENSAGEM.

       PROGRAM-DONE.
           STOP RUN.

       LIMPA-TERMINAL.
           CALL "SYSTEM" USING "CLS".

       EXIBIR-MENSAGEM.
           DISPLAY MENSAGEM.

       ENTRADA-DE-VALORES.
           DISPLAY "ENTRA COM O VALOR PARA A:".
           ACCEPT VALOR-A.
           DISPLAY "ENTRE COM O VALOR PARA B:".
           ACCEPT VALOR-B.

       SOMAR-NUMEROS.
           ADD VALOR-A TO VALOR-B GIVING RESPOSTA.
