       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG36.
      *    PROGRAMA PARA INSERIR DADOS EM ARQUIVO INDEXADO.
      *    WRITE COM INVALID KEY.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ARQUIVO-FUNCIONARIO
            ASSIGN TO "funcionarios.dat"
            ORGANIZATION IS INDEXED
            RECORD KEY IS FUNCIONARIO-CODIGO
            ACCESS MODE IS DYNAMIC.
       DATA DIVISION.
       FILE SECTION.
       FD  ARQUIVO-FUNCIONARIO.
       01  FUNCIONARIO-REGISTRO.
           05 FUNCIONARIO-CODIGO PIC 9(4).
           05 FUNCIONARIO-NOME PIC X(20).
           05 FUNCIONARIO-ENDERECO PIC X(50).
           05 FUNCIONARIO-TELEFONE PIC X(15).
           05 FUNCIONARIO-EMAIL PIC X(30).

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           PERFORM LIMPAR-TELA.
           OPEN I-O ARQUIVO-FUNCIONARIO.

           PERFORM LER-E-ESCREVE-REGISTRO.

           CLOSE ARQUIVO-FUNCIONARIO.
       PROGRAM-DONE.
           STOP RUN.

       LER-E-ESCREVE-REGISTRO.
           DISPLAY "==========================================".
           DISPLAY " INSERINDOS DADOS NO ARQUIVO".
           DISPLAY "==========================================".
           MOVE SPACE TO FUNCIONARIO-REGISTRO.
           MOVE ZEROS TO FUNCIONARIO-CODIGO.
           DISPLAY"INFORME O CÓDIGO DO FUNCIONÁRIO(1-9999):"
           ACCEPT FUNCIONARIO-CODIGO.
           DISPLAY "INFORME O NOME DO FUNCIONÁRIO:".
           ACCEPT FUNCIONARIO-NOME.
           DISPLAY "INFORME O ENDERECO DO FUNCIONÁRIO:".
           ACCEPT FUNCIONARIO-ENDERECO.
           DISPLAY "INFORME O TELEFONE:".
           ACCEPT FUNCIONARIO-TELEFONE.
           DISPLAY "INFORME O EMAIL DO FUNCIONÁRIO:".
           ACCEPT FUNCIONARIO-EMAIL.

           WRITE FUNCIONARIO-REGISTRO
            INVALID KEY
            DISPLAY "CÓDIGO :"FUNCIONARIO-CODIGO " JÁ CADASTRADO!".

       LIMPAR-TELA.
      *    COMANDO USADO PARA COMPILAÇÃO EM AMBIENTE WINDOWS 10.     
           CALL "SYSTEM" USING "CLS".

