       IDENTIFICATION DIVISION.
       PROGRAM-ID. CRIA_ARQ_SEQ.
      *    CRIA ARQUIVO.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT OPTIONAL ARQUIVO-CLIENTE
           ASSIGN TO "contato_1.dat"
           ORGANIZATION IS SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD  ARQUIVO-CLIENTE.
      *     LABEL RECORDS ARE STANDARD.
       01  CLIENTE-REGISTRO.
           05 CLIENTE-NOME PIC X(25).
           05 CLIENTE-CELULAR PIC X(20).

       WORKING-STORAGE SECTION.
       01  RESPOSTA PIC X.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           PERFORM LIMPA-TELA.
           OPEN EXTEND ARQUIVO-CLIENTE.
           MOVE "S" TO RESPOSTA.
           PERFORM ADICIONA-REGISTROS
                UNTIL RESPOSTA = "N".
           CLOSE ARQUIVO-CLIENTE.
       PROGRAM-DONE.
           STOP RUN.

       ADICIONA-REGISTROS.
           MOVE SPACE TO CLIENTE-REGISTRO.
           DISPLAY "INFORME O NOME:".
           ACCEPT CLIENTE-NOME.
           DISPLAY "INFORME O CELULAR:".
           ACCEPT CLIENTE-CELULAR.
           WRITE CLIENTE-REGISTRO.
           DISPLAY"----------".
           DISPLAY "DESEJA ADICIONAR OUTRO CLIENTE? (S/N)".
           ACCEPT RESPOSTA.

       LIMPA-TELA.
           CALL "SYSTEM" USING "CLS".
