       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRINCIPAL-SOMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM1     PIC 9(4) VALUE 15.
       01 NUM2     PIC 9(4) VALUE 25.
       01 RESULT   PIC 9(4) VALUE ZERO.
       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           CALL 'SOMAR-SUB' USING NUM1 NUM2 RESULT.
           DISPLAY "Resultado da soma: " RESULT.
       PROGRAM-DONE.
           STOP RUN.
