       IDENTIFICATION DIVISION.
       PROGRAM-ID. SOMAR-SUB.
       DATA DIVISION.
       LINKAGE SECTION.
       01 P-NUM1    PIC 9(4).
       01 P-NUM2    PIC 9(4).
       01 P-RESULT  PIC 9(4).
       PROCEDURE DIVISION USING P-NUM1 P-NUM2 P-RESULT.
           ADD P-NUM1 TO P-NUM2 GIVING P-RESULT
           GOBACK.
